app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT * FROM `messages`

  def create

    if is_amf
      @message = Message.new(:text=>params[0][:text])
    else
      @message = Message.new(params[:message])
    end

    respond_to do |format|
      if @message.save
---
INSERT INTO `messages` (`created_at`, `updated_at`, `text`) VALUES('2010-10-17 08:29:03', '2010-10-17 08:29:03', 'Hii there')